yzhkj/my-code/msp430程序/电赛 - 副本/lcd12864.h
#ifndef __LCD12864_H__
#define __LCD12864_H__

#include <msp430x14x.h>
#include "delay.h"

#define SetOut_RS                       (P6DIR |= BIT3)
#define RS_Out_1                        (P6OUT |= BIT3)
#define RS_Out_0                        (P6OUT &= ~BIT3)

#define SetOut_RW                       (P6DIR |= BIT4)
#define RW_Out_1                        (P6OUT |= BIT4)
#define RW_Out_0                        (P6OUT &= ~BIT4)

#define SetOut_EN                       (P6DIR |= BIT5)
#define EN_Out_1                        (P6OUT |= BIT5)
#define EN_Out_0                        (P6OUT &= ~BIT5)


#define SetOut_cs                       (P6DIR |= BIT6)
#define cs_Out_1                        (P6OUT |= BIT6)
#define cs_Out_0                        (P6OUT &= ~BIT6)

#define SETOUT_DIR1                       (P5DIR |= BIT0)
#define DIR1_OUT_1                        (P5OUT |= BIT0)
#define DIR1_OUT_0                        (P5OUT &= ~BIT0)

#define SETOUT_EN1                        (P5DIR |= BIT1)
#define EN1_OUT_1                        (P5OUT |= BIT1)
#define EN1_OUT_0                        (P5OUT &= ~BIT1)

#define SETOUT_DIR2                       (P5DIR |= BIT3)
#define DIR2_OUT_1                        (P5OUT |= BIT3)
#define DIR2_OUT_0                        (P5OUT &= ~BIT3)

#define SETOUT_EN2                        (P5DIR |= BIT2)
#define EN2_OUT_1                        (P5OUT |= BIT2)
#define EN2_OUT_0                        (P5OUT &= ~BIT2)

void lcd12864_init(void);
void lcd12864_write(unsigned char dat);
void lcd12864_write_command(unsigned char com);
void lcd12864_write_dat(unsigned char dat);
void lcd12864_display_string(unsigned char hang,unsigned char lie,unsigned char *p);
void lcd12864_display_TwoNum(unsigned char hang,unsigned char lie,unsigned char num);

#endif